artillery/scenarios/create-post.yml
# 게시글 작성 테스트
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 100


scenarios:
  - flow:
      # 먼저 로그인
      # userlist는 미리 생성해두기 .csv 파일 형태로 생성
      - post:
          url: "/api/user/login"
          json:
            email: "test@test.com"
            password: "test"
          expect:
            - statusCode: 200
          capture:
            - header: "authorization"
              as: "accessToken"
      - think: 1

      - post:
          url: "/api/post"
          json:
            title: "Test Post"
            content: "This is a test post"
            visibility: "PUBLIC"
            is_anonymous: false
          headers:
            Authorization: "{{ accessToken }}"  
          expect:
            - statusCode: 201
      - think: 1


      - get:
          url: "/api/post/{{ postId }}"
          headers:
            Authorization: "{{ accessToken }}"
          expect:
            - statusCode: 200
      - think: 1