artillery/scenarios/get-userinfo.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10

scenarios:
  - flow:
      - get:
          url: "/api/user/{{ userId }}"  # 로그인에서 저장한 ID 사용
          headers:
            Authorization: "{{ accessToken }}" # 토큰 사용
          expect:
            - statusCode: 200